{
  "jobs" : [
    {
      "from" : 2014,
      "to"   : "now",
      "company" : "Univa Paycast",
      "location" : "Tokyo, Japan",
      "title" : "Full Stack Developer",
      "description" : "This position allowed me to work on various projects both frontend and backend side. My main projects in Univa Paycast are Gyro-n, IPS and many other minor projects. For work related with frontend I use framework such as Backbone.js and React.js mostly and for backend implementations various languages such as Scala, Clojure. I also could get some experience with mobile development of native applications for iOS using Swift language."
    },
    {
      "from" : 2012,
      "to"   : 2014,
      "company" : "UK2 Group",
      "location" : "London, United Kingdom",
      "title" : "Front End Developer",
      "description" : "In this project my main part was frontend developing for UK2 Group and its companies such as UK2, Midphase, Reseller.biz etc. My general role was to develop client and admin dashboards and control panel which their customers use to mange hosting plans, registered domains, virtual and dedicated servers and such. In this project I was using mainly Vanilla Javascript and Backbone JS. Sometime I also worked with back end team developing web services based mostly on Perl Dancer framework."
    },
    {
      "from" : 2012,
      "to"   : 2013,
      "company" : "mBank",
      "location" : "Warsaw, Poland",
      "title" : "Front End Developer",
      "description" : "Participating in this project gave me opportunity to develop web applications with developers from bank team. I was member of development team of The New mBank – main retail bank brand within BRE Bank group. Brand mBank is one of the largest retail bank in Poland and working on new, completely redesigned transaction system allowed me to gain a lot of experience. My task were mainly focused on frontend part system modules which were done mostly using Backbone.js and Backbone.Marionette libraries. "
    },
    {
      "from" : 2011,
      "to"   : 2012,
      "company" : "Sidnet",
      "location" : "Warsaw, Poland",
      "title" : "Full Stack Developer",
      "description" : "Project managing and developing web applications using new technologies such as PHP, dynamic HTML with Javascript using framework such as Angular and Backbone. I was main developer of web portal for ZT Kruszwica, one of the largest producer of vegetable oil – Kujawski. In this project I was responsible for backend part and because of great amount of users optimization was priority. This was done by implementing cache, content indexing tools and database optimization."
    },
    {
      "from" : 2010,
      "to"   : 2011,
      "company" : "Monte Carlo",
      "location" : "Tokyo, Japan",
      "title" : "Back End Developer",
      "description" : "During this time I was part of the team combined of mostly Japanese people and few people from Europe and US. The main project I was taking part with was social network portal based on Japanese market. It has both regular web frontend and frontend optimized for mobile devices. Working with this Japanese company gained me a lot of experience with working on a big project in bigger team."
    },
    {
      "from" : 2009,
      "to"   : 2011,
      "company" : "Netkata",
      "location" : "Warsaw, Poland",
      "title" : "Full Stack Developer",
      "description" : "During that time I was working on multiple project using mainly open source tech stack such as PHP, PostgreSQL, MySQL, Apache, Linux and others. My work was focused on both front and back end. In Netkata I also worked extensively with Facebook API, developing many Facebook applications for companies such as ASUS, Acer, Panasonic and many more."
    },
    {
      "from" : 2007,
      "to"   : 2009,
      "company" : "Positive Design",
      "location" : "Warsaw, Poland",
      "title" : "Full Stack Developer",
      "description" : "Served as the primary web developer in company. Helped build and grow the variety of sites including business identity sites, e-commerce solutions, social Internet portals. Online business consulting from securing domain names, project planning, finding and improving existing solutions. Developing backend using PHP, MySQL, Javascript, CSS, HTML/XHTML and mainly using object oriented programming based on MVC model with Kohana PHP framework."
    }
  ]
}
